### I hope you have learned about pandas in a quite good manner , now its time to move on to a test for it. Here you are provided with some questions of which you need to write the code and test your understanding of the concept.

In [1]:
import pandas as pd
import numpy as np

### Q1.

```
import numpy as np
mylist = list('abcedfghijklmnopqrstuvwxyz')
myarr = np.arange(26)
mydict = dict(zip(mylist, myarr))
```
**Write code to convert the above mydict variable into dataframe , your code should return a dataframe like below.**

```
a    0
b    1
c    2
d    4
```

In [50]:
import numpy as np
mylist = list('abcedfghijklmnopqrstuvwxyz')
myarr = np.arange(26)
mydict = pd.DataFrame(zip(mylist,myarr))

In [51]:
mydict

    0   1
0   a   0
1   b   1
2   c   2
3   e   3
4   d   4
5   f   5
6   g   6
7   h   7
8   i   8
9   j   9
10  k  10
11  l  11
12  m  12
13  n  13
14  o  14
15  p  15
16  q  16
17  r  17
18  s  18
19  t  19
20  u  20
21  v  21
22  w  22
23  x  23
24  y  24
25  z  25

### Q2. Write the code to get frequency count of each character from the result of below command
```
ser = pd.Series(np.take(list('abcdefgh'), np.random.randint(8, size=30)))
```

In [3]:
## your output should look like this.

f    7
c    5
g    4
b    4
h    4
e    3
a    3
dtype: int64

In [31]:
ser = pd.Series(np.take(list('abcdefgh'), np.random.randint(8, size=30)))

In [72]:
ser.value_counts()

e    7
c    5
a    4
f    4
d    3
h    3
b    3
g    1
dtype: int64

### Q3. What parameter to do we need to add in read_csv, which let us read only a bunch of columns from the whole dataset.

In [ ]:
# just write that parameter name here

In [ ]:
usecols parameter

<p style="color:brown;">For Next 3 question you need to work on fruits sample dataset provided in resources.</p>

In [15]:
# read fruits.csv file
df=pd.read_csv(r"C:\Users\Munna kumar\Downloads\fruits.csv")

In [16]:
df

   Fruit Name  Quantity  Price
0      Banana        78    112
1       Mango        40    160
2      Banana        20     85
3   PineApple        15     90
4  Strawberry       100    200
5       Mango        25     60
6       Mango        40    100
7   PineApple        50    285

### Q4. Get mean, median, max , min price for each fruit .

In [9]:
# Your output should look like this

   Fruit Name        mean  median  max
0      Banana   98.500000    98.5  112
1       Mango  106.666667   100.0  160
2   PineApple  187.500000   187.5  285
3  Strawberry  200.000000   200.0  200

In [ ]:
# Note that the reset_index method is used to convert the index into a column.

In [47]:
df.groupby('Fruit Name')['Price'].agg(['mean', 'median', 'max', 'min']).reset_index()

   Fruit Name        mean  median  max  min
0      Banana   98.500000    98.5  112   85
1       Mango  106.666667   100.0  160   60
2   PineApple  187.500000   187.5  285   90
3  Strawberry  200.000000   200.0  200  200

### Q5. What is the total cost of this basket?

In [10]:
#your output should be this

1092

In [57]:
total_cost = df['Price'].sum()

In [58]:
total_cost

1092

### Q6. Which fruit has the maximum price per quantity?

In [13]:
# your output should be

'PineApple'

In [59]:
df

   Fruit Name  Quantity  Price
0      Banana        78    112
1       Mango        40    160
2      Banana        20     85
3   PineApple        15     90
4  Strawberry       100    200
5       Mango        25     60
6       Mango        40    100
7   PineApple        50    285

In [60]:
max_price_fruit=df['Price'].max()

In [69]:
max_price_fruit= df['Fruit Name'].max(),df['Price'].max(),df['Quantity'].max()

In [70]:
max_price_fruit

('Strawberry', 285, 100)

### Q7. Given an array 
```arr = [ 0,1,0,1,0,2,3,6,5,0,0,0,4,1,2,3,5,5,4,4 ]```
<br>
**Write code to  Create one_hot encoded dataframe of this array.**

In [18]:
#your output should be like this and should have 20 records in total

   0  1  2  3  4  5  6
0  1  0  0  0  0  0  0
1  0  1  0  0  0  0  0
2  1  0  0  0  0  0  0
3  0  1  0  0  0  0  0
4  1  0  0  0  0  0  0

In [3]:
arr = [ 0,1,0,1,0,2,3,6,5,0,0,0,4,1,2,3,5,5,4,4 ]

In [4]:
df=pd.DataFrame(arr)

In [5]:
df

    0
0   0
1   1
2   0
3   1
4   0
5   2
6   3
7   6
8   5
9   0
10  0
11  0
12  4
13  1
14  2
15  3
16  5
17  5
18  4
19  4

In [8]:
df1 = pd.get_dummies(df[0])

In [9]:
df1

    0  1  2  3  4  5  6
0   1  0  0  0  0  0  0
1   0  1  0  0  0  0  0
2   1  0  0  0  0  0  0
3   0  1  0  0  0  0  0
4   1  0  0  0  0  0  0
5   0  0  1  0  0  0  0
6   0  0  0  1  0  0  0
7   0  0  0  0  0  0  1
8   0  0  0  0  0  1  0
9   1  0  0  0  0  0  0
10  1  0  0  0  0  0  0
11  1  0  0  0  0  0  0
12  0  0  0  0  1  0  0
13  0  1  0  0  0  0  0
14  0  0  1  0  0  0  0
15  0  0  0  1  0  0  0
16  0  0  0  0  0  1  0
17  0  0  0  0  0  1  0
18  0  0  0  0  1  0  0
19  0  0  0  0  1  0  0

In [19]:
df=pd.DataFrame(arr,columns=['values'])

In [20]:
df

    values
0        0
1        1
2        0
3        1
4        0
5        2
6        3
7        6
8        5
9        0
10       0
11       0
12       4
13       1
14       2
15       3
16       5
17       5
18       4
19       4

### Q8. 
```
dict_ = {'First Score':[100, 90, np.nan, 95],
        'Second Score': [30, 45, 56, np.nan],
        'Third Score':[np.nan, 40, 80, 98]

```
#### a. Convert this above dict to pandas dataframe

In [22]:
#your output should be like this

   First Score  Second Score  Third Score
0        100.0          30.0          NaN
1         90.0          45.0         40.0
2          NaN          56.0         80.0
3         95.0           NaN         98.0

In [6]:
dict_ = {'First Score':[100, 90, np.nan, 95],
        'Second Score': [30, 45, 56, np.nan],
        'Third Score':[np.nan, 40, 80, 98]}

In [8]:
df=pd.DataFrame(dict_)

In [9]:
df

   First Score  Second Score  Third Score
0        100.0          30.0          NaN
1         90.0          45.0         40.0
2          NaN          56.0         80.0
3         95.0           NaN         98.0

#### b. Write code to get the number of missing values for each column.

In [23]:
#your output should be like this

First Score     1
Second Score    1
Third Score     1
dtype: int64

In [11]:
df.isnull().sum()

First Score     1
Second Score    1
Third Score     1
dtype: int64

#### c. Fill this nan values with mean value of their respective column

In [27]:
#your output should be like this

   First Score  Second Score  Third Score
0        100.0     30.000000    72.666667
1         90.0     45.000000    40.000000
2         95.0     56.000000    80.000000
3         95.0     43.666667    98.000000

In [13]:
df.fillna(df.mean())

   First Score  Second Score  Third Score
0        100.0     30.000000    72.666667
1         90.0     45.000000    40.000000
2         95.0     56.000000    80.000000
3         95.0     43.666667    98.000000

### Q9. Add an index column to the table used in Q4.
*HINT : Rest index*

In [28]:
#your output should be like this

   index  Fruit Name  Quantity  Price  price/quantity
0      0      Banana        78    112        1.435897
1      1       Mango        40    160        4.000000
2      2      Banana        20     85        4.250000
3      3   PineApple        15     90        6.000000
4      4  Strawberry       100    200        2.000000
5      5       Mango        25     60        2.400000
6      6       Mango        40    100        2.500000
7      7   PineApple        50    285        5.700000

In [27]:
df = df.reset_index().rename(columns={'index': 'index'})

In [28]:
df

   index  Fruit Name  Quantity  Price
0      0      Banana        78    112
1      1       Mango        40    160
2      2      Banana        20     85
3      3   PineApple        15     90
4      4  Strawberry       100    200
5      5       Mango        25     60
6      6       Mango        40    100
7      7   PineApple        50    285

### Q10. 
**You are provided wih two different csv files ,**
```
sample_sheet_1.csv
sample_sheet_2.csv 
```
<p>
    
**You just need to read both of them , and merge them based on location column.**

In [30]:
#your output should be like this

  Location Population  ...  No. of shops Weekly market day
0      ABB   2.5 lakh  ...           150   Nothing as such
1      ABC   1.5 lakh  ...           120           Tuesday
2      CDD   3.5 lakh  ...           180         Wednesday

[3 rows x 6 columns]

In [3]:
df1=pd.read_csv(r'C:\Users\Munna kumar\Downloads\sample_sheet_1.csv')

In [4]:
df1

  Location Population  House_count Location Area
0      ABB   2.5 lakh          763    25 hectare
1      ABC   1.5 lakh          520    20 hectare
2      CDD   3.5 lakh          800    35 hectare

In [5]:
df2=pd.read_csv(r'C:\Users\Munna kumar\Downloads\sample_sheet_2.csv')

In [6]:
df2

  Location  No. of shops Weekly market day
0      ABB           150   Nothing as such
1      ABC           120           Tuesday
2      CDD           180         Wednesday

In [13]:
df1.merge(df2, how = 'inner')

,Location,Population,House_count,Location Area,No. of shops,Weekly market day
0,ABB,2.5 lakh,763,25 hectare,150,Nothing as such
1,ABC,1.5 lakh,520,20 hectare,120,Tuesday
2,CDD,3.5 lakh,800,35 hectare,180,Wednesday